RouNNdeL/esp8266-leds/src/main.cpp
#include <Arduino.h>
#include <WiFiManager.h>
#include <ESP8266WebServer.h>
#include <Adafruit_NeoPixel.h>
#include <EEPROM.h>
#include <WiFiUdp.h>
#include <ESP8266httpUpdate.h>
#include <ArduinoOTA.h>

extern "C" {
#include "user_interface.h"
#include "color_utils.h"
}

#include "config.h"
#include "memory.h"

Adafruit_NeoPixel strip = Adafruit_NeoPixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
ESP8266WebServer server(80);
WiFiUDP udp;

#define FLAG_NEW_FRAME (1 << 0)
#define FLAG_QUICK_TRANSITION (1 << 2)
#define FLAG_HALT (1 << 7)

#define not_halt() !(flags & FLAG_HALT)
#define halt() flags & FLAG_HALT

os_timer_t frameTimer;
volatile uint32_t frame;
volatile uint8_t flags;

led_count_t virtual_devices_led_count[DEVICE_COUNT] = VIRTUAL_DEVICES;

uint8_t device_flags[DEVICE_COUNT];

global_settings globals;
#define increment_profile() globals.current_profile = (globals.current_profile+1)%globals.profile_count

/* The first 3 bytes are the current color, the last 3 bytes are the old color to transition from */
uint8_t color_converted[6 * DEVICE_COUNT] = {};

#if TRANSITION_EFFECTS
/* Used when effects are enabled and a brightness transition is about to take place */
uint8_t transition_brightness_old[DEVICE_COUNT];
uint8_t transition_brightness_new[DEVICE_COUNT];
#endif

volatile transition_t transition_frame[DEVICE_COUNT] = {0};
transition_t transition_frames[DEVICE_COUNT];
String requestId = "";

device_effect current_effect[DEVICE_COUNT];
uint16_t frames[DEVICE_COUNT][TIME_COUNT];
uint32_t auto_increment;

#define ALL 0
#define ANY 1
#define SET 1
#define NOT_SET 0

#define all_enabled() all_any_flag_set(globals.flags, GLOBALS_FLAG_ENABLED, ALL, SET)
#define any_enabled() all_any_flag_set(globals.flags, GLOBALS_FLAG_ENABLED, ANY, SET)
#define all_disabled() all_any_flag_set(globals.flags, GLOBALS_FLAG_ENABLED, ALL, NOT_SET)
#define any_disabled() all_any_flag_set(globals.flags, GLOBALS_FLAG_ENABLED, ANY, NOT_SET)

uint8_t all_any_flag_set(uint8_t *flag_array, uint8_t flag, uint8_t any, uint8_t set) {
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i) {
        if(flag_array[i] & flag ^ set ^ any)
            return any;
    }
    return !any;
}

uint16_t time_to_frames(uint8_t time) {
    if(time <= 80) {
        return time * FPS / 16;
    }
    if(time <= 120) {
        return time * FPS / 8 - 5 * FPS;
    }
    if(time <= 160) {
        return time * FPS / 2 - 50 * FPS;
    }
    if(time <= 190) {
        return (time - 130) * FPS;
    }
    if(time <= 235) {
        return (2 * time - 320) * FPS;
    }
    if(time <= 245) {
        return (15 * time - 3375) * FPS;
    }
    return (60 * time - 14400) * FPS;
}

void convert_to_frames(uint16_t *frames, uint8_t *times) {
    for(uint8_t i = 0; i < TIME_COUNT; ++i) {
        frames[i] = time_to_frames(times[i]);
    }
}

void convert_all_frames() {
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i) {
        convert_to_frames(frames[i], current_effect[i].timing);
    }
}

uint32_t autoincrement_to_frames(uint8_t time) {
    if(time <= 60) {
        return time * FPS / 2;
    }
    if(time <= 90) {
        return (time - 30) * FPS;
    }
    if(time <= 126) {
        return (5 * time / 2 - 165) * FPS;
    }
    if(time <= 156) {
        return (5 * time - 480) * FPS;
    }
    if(time <= 196) {
        return (15 * time - 2040) * FPS;
    }
    if(time <= 211) {
        return (60 * time - 10860) * FPS;
    }
    if(time <= 253) {
        return (300 * time - 61500) * FPS;
    }
    if(time == 254) return 18000 * FPS;
    return 21600 * FPS;
}

void convert_color_and_brightness() {
    for(uint8_t d = 0; d < DEVICE_COUNT; ++d) {
        uint8_t index = d * 6;

        /* Copy the now old color to its place (3 bytes after the new) */
        memcpy(color_converted + index + 3, color_converted + index, 3);

        uint8_t brightness = (globals.flags[d] & GLOBALS_FLAG_ENABLED) ? globals.brightness[d] : 0;
        set_color_manual(color_converted + index, color_brightness(brightness, color_from_buf(globals.color + d * 3)));

#if TRANSITION_EFFECTS
        transition_brightness_old[d] = transition_brightness_new[d];
        transition_brightness_new[d] = brightness;
#endif

        if(globals.flags[d] & FLAG_QUICK_TRANSITION)
            transition_frames[d] = TRANSITION_QUICK_FRAMES;
        else
            transition_frames[d] = TRANSITION_FRAMES;
        device_flags[d] |= DEVICE_FLAG_TRANSITION;
    }
}


void save_modified() {
    for(uint8_t d = 0; d < DEVICE_COUNT; ++d) {
        if(device_flags[d] & DEVICE_FLAG_EFFECT_UPDATED) {
            save_effect(&current_effect[d], d, globals.current_device_profile[d]);
            device_flags[d] &= ~DEVICE_FLAG_EFFECT_UPDATED;
        }
    }
}

void refresh_devices() {
    for(uint8_t d = 0; d < DEVICE_COUNT; ++d) {
        load_effect(&current_effect[d], d, globals.current_device_profile[d]);
    }
    convert_all_frames();
}

void load_profile(uint8_t n) {
    for(uint8_t d = 0; d < DEVICE_COUNT; d++) {
        if(globals.profiles[n][d] > -1) {
            load_effect(&current_effect[d], d, globals.profiles[n][d]);
            globals.current_device_profile[d] = globals.profiles[n][d];
        }
    }
    globals.profile_flags[globals.current_profile] = globals.profile_flags[n];
    save_globals(&globals);
}

void refresh_profile() {
    load_profile(globals.current_profile);
    convert_all_frames();
}

void timerCallback(void *pArg) {
    flags |= FLAG_NEW_FRAME;
    frame++;
    for(int d = 0; d < DEVICE_COUNT; ++d) {
        if(device_flags[d] & DEVICE_FLAG_TRANSITION) {
            transition_frame[d]++;
        }
    }
}

void user_init() {
    os_timer_setfn(&frameTimer, timerCallback, NULL);
    os_timer_arm(&frameTimer, 10, true);
}

void eeprom_init() {
    load_globals(&globals);
    auto_increment = autoincrement_to_frames(globals.auto_increment);
    refresh_profile();
    convert_color_and_brightness();
    for(int d = 0; d < DEVICE_COUNT; ++d) {
#if TRANSITION_EFFECTS
        transition_brightness_old[d] = transition_brightness_new[d];
#endif
        memcpy(color_converted + d * 6 + 3, color_converted + d * 6, 3);
        device_flags[d] &= ~DEVICE_FLAG_TRANSITION;
        transition_frame[d] = 0;
    }
}

uint8_t char2int(char input) {
    if(input >= '0' && input <= '9')
        return input - '0';
    if(input >= 'A' && input <= 'F')
        return input + 10 - 'A';
    if(input >= 'a' && input <= 'f')
        return input + 10 - 'a';
    return 0;
}

void setStripStatus(uint8_t r, uint8_t g, uint8_t b) {
    led_count_t virtual_led_offset = 0;
    for(uint8_t d = 0; d < DEVICE_COUNT; ++d) {
        uint8_t *p = strip.getPixels() + virtual_led_offset * 3;
        if(!(globals.flags[d] & GLOBALS_FLAG_STATUSES))
            return;
        strip.setBrightness(UINT8_MAX);
        for(led_count_t j = 0; j < virtual_devices_led_count[d]; ++j) {
            if(j % 4) {
                set_color_manual(p, grb(color_brightness(12, r, g, b)));
            } else {
                set_color_manual(p, grb(r, g, b));
            }
        }
        strip.show();
        virtual_led_offset += virtual_devices_led_count[d];
    }
}

int32_t checkUpdate() {
    int32_t code;
    uint8_t tries = 0;
    do {
        tries++;
        HTTPClient http;

#if HTTP_UPDATE_HTTPS
        http.begin(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTPS, String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID,
                   HTTP_SERVER_HTTPS_FINGERPRINT);
#else
        http.begin(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTP, String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID);
#endif /* HTTP_UPDATE_HTTPS */
        http.useHTTP10(true);
        http.setTimeout(2500);
        http.setUserAgent(F("ESP8266-http-Update"));
        http.addHeader(F("x-Request-Attempts"), String(tries));
        http.addHeader(F("x-ESP8266-STA-MAC"), WiFi.macAddress());
        http.addHeader(F("x-ESP8266-AP-MAC"), WiFi.softAPmacAddress());
        http.addHeader(F("x-ESP8266-free-space"), String(ESP.getFreeSketchSpace()));
        http.addHeader(F("x-ESP8266-sketch-size"), String(ESP.getSketchSize()));
        http.addHeader(F("x-ESP8266-sketch-md5"), String(ESP.getSketchMD5()));
        http.addHeader(F("x-ESP8266-chip-size"), String(ESP.getFlashChipRealSize()));
        http.addHeader(F("x-ESP8266-sdk-version"), ESP.getSdkVersion());
        http.addHeader(F("x-ESP8266-mode"), F("check"));
        http.addHeader(F("x-ESP8266-version"), String(VERSION_CODE));

        code = http.GET();
        http.end();
    }
    while((code == -1 || code == -11) && tries < REQUEST_RETIRES);
    return code;
}

HTTPUpdateResult update(uint8_t reboot) {
    setStripStatus(COLOR_MAGENTA);
#if SERIAL_DEBUG
    Serial.println("[OTA] Checking for updates...");
#endif /* SERIAL_DEBUG */
    ESPhttpUpdate.rebootOnUpdate(false);
#if HTTP_UPDATE_HTTPS
    HTTPUpdateResult ret = ESPhttpUpdate.update(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTPS,
                                                String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID,
                                                String(VERSION_CODE), HTTP_SERVER_HTTPS_FINGERPRINT);
#else
    HTTPUpdateResult ret = ESPhttpUpdate.update(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTP,
                                                String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID,
                                                String(VERSION_CODE));
#endif /* HTTP_UPDATE_HTTPS */
    switch(ret) {
        case HTTP_UPDATE_FAILED:
#if SERIAL_DEBUG
            Serial.println("[OTA] Update failed");
#endif /* SERIAL_DEBUG */
            setStripStatus(COLOR_RED);
            yield();
            delay(1000);
            break;
        case HTTP_UPDATE_NO_UPDATES:
#if SERIAL_DEBUG
            Serial.println("[OTA] No update");
#endif
            setStripStatus(rgb(244, 165, 0));
            yield();
            delay(1000);
            break;
        case HTTP_UPDATE_OK:
#if SERIAL_DEBUG
            Serial.println("[OTA] Update successful"); // may not called we reboot the ESP
#endif /* SERIAL_DEBUG */
            setStripStatus(COLOR_GREEN);
            yield();
            delay(1000);
            if(reboot) {
#if SERIAL_DEBUG
                Serial.println("[OTA] Rebooting...");
#endif /* SERIAL_DEBUG */
                delay(250);
                ESP.restart();
            }
            break;
    }
    return ret;
}

String getDeviceJson() {
    String brightness_array = "[";
    String flags_array = "[";
    String color_array = "[";
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i) {
        if(i) brightness_array += ",";
        if(i) flags_array += ",";
        if(i) color_array += ",";

        brightness_array += String(globals.brightness[i]);
        flags_array += String(globals.flags[i]);
        uint8_t index = i * 3;
        color_array += String(
                (uint32_t) globals.color[index] << 16 |
                (uint16_t) globals.color[index + 1] << 8 |
                globals.color[index + 2]
        );
    }
    brightness_array += "]";
    flags_array += "]";
    color_array += "]";

    String content = R"({"ap_name":")" + String(AP_NAME) +
                     R"(","version_code":)" + String(VERSION_CODE) +
                     R"(,"version_name":")" + String(VERSION_NAME) +
                     R"(","device_id":")" + DEVICE_ID +
                     "\",\"auto_increment\":" + String(auto_increment / FPS) +
                     ",\"current_effect\":" + String(globals.current_profile) +
                     ",\"color\":" + color_array +
                     ",\"flags\":" + flags_array +
                     ",\"brightness\":" + brightness_array + "}";
    return content;
}

int32_t sendDeviceHalted() {
    int32_t code;
    uint8_t tries = 0;
    do {
        tries++;
        HTTPClient http;
#if HTTP_HALT_HTTPS
        http.begin(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTPS, String(HTTP_HALT_URL), HTTP_SERVER_HTTPS_FINGERPRINT);
#else
        http.begin(HTTP_SERVER_HOST, HTTP_SERVER_PORT_HTTP, String(HTTP_HALT_URL));
#endif /* HTTP_UPDATE_HTTPS */

