RouNNdeL/esp8266-leds/src/main.cpp
        http.setUserAgent(F("ESP8266"));
        http.addHeader(F("Content-Type"), "application/json");
        http.addHeader(F("x-Request-Attempts"), String(tries));

        code = http.POST(getDeviceJson());
        http.end();
    }
    while((code == -1 || code == -11) && tries < REQUEST_RETIRES);
    return code;
}

#if PAGE_DEBUG

void ICACHE_FLASH_ATTR debug_info() {
    String r = String(globals.color[0], 16);
    String g = String(globals.color[1], 16);
    String b = String(globals.color[2], 16);
    r = r.length() == 1 ? "0" + r : r;
    g = g.length() == 1 ? "0" + g : g;
    b = b.length() == 1 ? "0" + b : b;

    String flags_array = "[";
    String brightness_array = "[";
    for(uint8_t i = 0; i < DEVICE_COUNT; i++) {
        if(i) flags_array += ",";
        if(i) brightness_array += ",";

        flags_array += String(globals.flags[i]);
        brightness_array += String(globals.brightness[i]);
    }
    flags_array += "]";
    brightness_array += "]";


    String content = "<h2>" + String(AP_NAME) + "</h2>";
    content += "<p>config_url: <a href=\"" + String(CONFIG_PAGE) + "\">" + CONFIG_PAGE + "</a></p>";
    content += "<p>version_code: <b>" + String(VERSION_CODE) + "</b></p>";
    content += "<p>version_name: <b>" + String(VERSION_NAME) + "</b></p>";
    content += "<p>build_date: <b>" + BUILD_DATE + "</b></p>";
    content += "<p>reset_info: <b>" + ESP.getResetReason() + "</b></p>";
    content += "<p>device_id: <b>" + String(DEVICE_ID) + "</b></p>";
    content += "<p>device_flags: <b>" + String(flags) + "</b></p>";
    content += "<p>device_frame: <b>" + String(frame) + "</b></p>";
    content += "<p>device_transition_frame: <b>" + String(transition_frame[0]) + "</b></p>";
    content += "<p>flags: <b>" + flags_array + "</b></p>";
    content += "<p>color: <b>#" + r + g + b + "</b></p>";
    content += "<p>brightness: <b>" + brightness_array + "</b></p>";
    content += "<p>profile_count: <b>" + String(globals.profile_count) + "</b></p>";
    content += "<p>auto_increment: <b>" + String(globals.auto_increment) + "</b></p>";
    content += "<p>auto_increment frames: <b>" + String(auto_increment) + "</b></p>";
    content += "<p>current_effect: <b>" + String(globals.current_profile) + "</b></p>";
    content += "<p>current_device_profile: <b>[";
    for(uint8_t i = 0; i < DEVICE_COUNT; i++) {
        if(i) content += ",";
        content += String(globals.current_device_profile[i]);
    }
    content += "]</b></p>";
    content += "<p>color_converted: <b>[";
    for(uint8_t i = 0; i < sizeof(color_converted); i++) {
        if(!(i % 6) && i) content += "], [";
        else if(!(i % 3) && i) content += " | ";
        else if(i % 6) content += ",";
        content += String(color_converted[i]);
    }
    content += "]</b></p>";
    server.send(200, "text/html", content);
}

#endif /* PAGE_DEBUG */

void ICACHE_FLASH_ATTR receive_globals() {
    if(server.hasArg("plain") &&
       server.method() == HTTP_PUT &&
       (server.arg("plain").length() == GLOBALS_SIZE * 2 ||
        (server.arg("plain").length() < GLOBALS_SIZE * 2 && server.arg("plain").end()[-1] == '*') ||
        (server.arg("plain").length() <= GLOBALS_SIZE * 2 + 1 && server.arg("plain")[0] == 'q'))) {
        uint8_t bytes[GLOBALS_SIZE];
        uint8_t quick = server.arg("plain")[0] == 'q' ? 1 : 0;
        auto c = server.arg("plain");
        for(uint8_t i = 0; i < GLOBALS_SIZE; ++i) {
            uint8_t j = i * 2 + quick;
            if(c[j] == '*' || c[j + 1] == '*') {
                memcpy(bytes + i, ((uint8_t *) &globals) + i, GLOBALS_SIZE - i);
                break;
            }
            if(c[j] == '?' && c[j + 1] == '?') {
                bytes[i] = ((uint8_t *) &globals)[i];
            } else {
                bytes[i] = char2int(c[j]) * 16 + char2int(c[j + 1]);
            }
        }

        uint8_t last_profile = globals.current_profile;
        uint8_t previous_auto_increment = globals.auto_increment;

        save_modified();
        memcpy(&globals, bytes, GLOBALS_SIZE);
        if(last_profile != globals.current_profile) {
            frame = 0;
            refresh_profile();
        } else {
            refresh_devices();
        }
        if(previous_auto_increment != globals.auto_increment) {
            auto_increment = autoincrement_to_frames(globals.auto_increment);
        }
        save_globals(&globals);

        server.send(204);
        quick ? (flags |= FLAG_QUICK_TRANSITION) : (flags &= ~FLAG_QUICK_TRANSITION);
        convert_color_and_brightness();
    } else {
#if SERIAL_DEBUG
        server.send(400, "text/html", "<h2>HTTP 400 Invalid Request</h2>");
#else
        server.send(400);
#endif /* SERIAL_DEBUG */
    }
}

void ICACHE_FLASH_ATTR redirect_to_config() {
    server.sendHeader("Location", CONFIG_PAGE);
    server.send(301);
}

void ICACHE_FLASH_ATTR receive_profile() {
    if(server.hasArg("plain") && server.arg("plain").length() == (DEVICE_SIZE + 2) * 2 && server.method() == HTTP_PUT) {
        uint8_t bytes[DEVICE_SIZE + 2];
        auto c = server.arg("plain");
        for(uint8_t i = 0; i < sizeof(bytes); ++i) {
            bytes[i] = char2int(c[i * 2]) * 16 + char2int(c[i * 2 + 1]);
        }

        if(globals.current_device_profile[bytes[1]] == bytes[0]) {
            memcpy(&current_effect[bytes[1]], bytes + 2, DEVICE_SIZE);
            convert_all_frames();
            device_flags[bytes[1]] |= DEVICE_FLAG_EFFECT_UPDATED;
        } else {
            device_effect tmp;
            memcpy(&tmp, bytes + 2, DEVICE_SIZE);
            save_effect(&tmp, bytes[1], bytes[0]);
        }
        server.send(204);
    } else {
#if SERIAL_DEBUG
        server.send(400, "text/html", "<h2>HTTP 400 Invalid Request</h2>");
#else
        server.send(400);
#endif /* SERIAL_DEBUG */
    }
}

void ICACHE_FLASH_ATTR handle_halt() {
    server.send(200, "text/plain", "Device has been halted to allow for manual recovery via ArduinoOTA");
}

void ICACHE_FLASH_ATTR handle_root() {
    // TODO: Add separate pages for each virtual device
    String r = String(globals.color[0], 16);
    String g = String(globals.color[1], 16);
    String b = String(globals.color[2], 16);
    r = r.length() == 1 ? "0" + r : r;
    g = g.length() == 1 ? "0" + g : g;
    b = b.length() == 1 ? "0" + b : b;
    String content =
            R"(<!DOCTYPE html><html lang="en"><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width, initial-scale=1.0"><title>)" +
            String(AP_NAME) + "</title></head><body><h2>" + AP_NAME +
            R"(</h2><p>You can change profiles and set a static color for your LEDs, for more advanced configuration click <a href="/config">here</a></p> <input id="a" type="color" value="#)" +
            r + g + b + R"(">)";
    content +=
            R"(<p><a href="/restart">Restart device</a></p><p><a href="/update">Check for updates</a></p> <script>document.getElementById("a").addEventListener("change",function(e){var t=new XMLHttpRequest;t.open("PUT","/globals",!0),t.send("????".repeat()" +
            String(DEVICE_COUNT) + R"()+e.target.value.substring(1).repeat()" + String(DEVICE_COUNT) +
            R"()+"*")});</script> </body></html>)";
    server.send(200, "text/html", content);
}

void ICACHE_FLASH_ATTR restart() {
    server.send(200, "text/html",
                F("<p>Your device is restarting...</p><p id=\"a\">It should come online in 15s</p><script>var a=15;setInterval(function(){a--; if(!a)window.location=\"/\";document.getElementById(\"a\").innerHTML=\"It should come online in \"+a+\"s\";},1000)</script>"));
    delay(500);
    ESP.restart();
}

void ICACHE_FLASH_ATTR send_json() {
    server.send(200, "application/json", getDeviceJson());
}

