RouNNdeL/esp8266-leds/src/main.cpp
void ICACHE_FLASH_ATTR manual_update_check() {
    auto code = checkUpdate();
    String statusString;
    switch(code) {
        case HTTP_CODE_NO_CONTENT:
            statusString = "Update found, click <a href=\"/apply_update\">here</a> to download and apply the update";
            break;
        case HTTP_CODE_NOT_MODIFIED:
            statusString = "No updates found, <a href=\"/\">return to the main page<a/>";
            break;
        default:
            statusString = "Update check failed: HTTP " + code;
            break;
    }
    server.send(200, "text/html", statusString);
}

void ICACHE_FLASH_ATTR apply_update() {
    server.send(200, "text/html",
                "<p>The device will now download the update and restart to apply the changes</p><p><a href=\"/\">Main page</a></p>");
    delay(500);
    update(1);
}

void on_disconnected(const WiFiEventStationModeDisconnected &event) {
    ESP.restart();
}

void configModeCallback(WiFiManager *myWiFiManager) {
    setStripStatus(COLOR_CYAN);
}

void recover() {
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i) {
        globals.brightness[i] = 0xff;
        globals.flags[i] = GLOBALS_FLAG_ENABLED | GLOBALS_FLAG_STATUSES;
        globals.profiles[0][i] = 0;
        globals.current_device_profile[i] = 0;

        current_effect[i].effect = BREATHE;
        current_effect[i].color_count = 3;
        current_effect[i].timing[TIME_OFF] = 0;
        current_effect[i].timing[TIME_FADEIN] = 10;
        current_effect[i].timing[TIME_ON] = 0;
        current_effect[i].timing[TIME_FADEOUT] = 10;
        current_effect[i].timing[TIME_ROTATION] = 0;
        current_effect[i].timing[TIME_DELAY] = 0;
        current_effect[i].args[ARG_BREATHE_START] = 0;
        current_effect[i].args[ARG_BREATHE_END] = 255;
        current_effect[i].args[ARG_COLOR_CYCLES] = 1;
        set_color_manual(current_effect[i].colors, grb(COLOR_RED));
        set_color_manual(current_effect[i].colors + 3, grb(COLOR_BLUE));
        set_color_manual(current_effect[i].colors + 6, grb(COLOR_GREEN));

        save_effect(&current_effect[i], i, 0);
    }

    globals.auto_increment = 0;
    globals.profile_count = 1;
    globals.current_profile = 0;

    convert_all_frames();

    save_globals(&globals);
    convert_color_and_brightness();
}

void ICACHE_FLASH_ATTR handle_recover() {
    recover();
    server.send(204);
}

void setup() {
#if SERIAL_DEBUG
    Serial.begin(115200);

    Serial.println("");
    Serial.println("|---------------------------|");
    Serial.println("|------ Begin Startup ------|");
    Serial.println("| LED Controller by RouNdeL |");
    Serial.println("|---------------------------|");

    Serial.println("Version Name: " + String(VERSION_NAME));
    Serial.println("Version Code: " + String(VERSION_CODE));
    Serial.println("Build Date: " + BUILD_DATE);
    Serial.println("Device Id: " + String(DEVICE_ID));
#endif /* SERIAL_DEBUG */

    EEPROM.begin(SPI_FLASH_SEC_SIZE);
    if(ESP.getResetInfoPtr()->reason == REASON_EXCEPTION_RST) {
#if SERIAL_DEBUG
        Serial.println("Exception detected: " + String(get_reset_count() + 1));
#endif /* SERIAL_DEBUG */
        if(get_reset_count() > RECOVERY_ATTEMPTS) {
            flags |= FLAG_HALT;
#if SERIAL_DEBUG
            Serial.println("HALT");
#endif /* SERIAL_DEBUG */
        } else if(get_reset_count() > RESTART_ATTEMPTS) {
            recover();
#if SERIAL_DEBUG
            Serial.println("Attempting to recover");
#endif /* SERIAL_DEBUG */
        }
        increase_reset_count();
    } else {
        set_reset_count(0);
    }

    if(not_halt()) {
        eeprom_init();
        strip.begin();
        setStripStatus(COLOR_RED);
    }

    WiFiManager manager;
#if !SERIAL_DEBUG
    manager.setDebugOutput(0);
#endif /* SERIAL_DEBUG */
    manager.setAPCallback(configModeCallback);
    manager.setAPStaticIPConfig(IPAddress(192, 168, 1, 1), IPAddress(192, 168, 1, 1), IPAddress(255, 255, 255, 0));
    manager.setConfigPortalTimeout(300);
    manager.autoConnect(AP_NAME);

    if(not_halt() && checkUpdate() == HTTP_CODE_OK) update(1);

#if SERIAL_DEBUG
    Serial.println("|---------------------------|");
    Serial.println("|------- Start LEDs --------|");
    Serial.println("|---------------------------|");
#endif /* SERIAL_DEBUG */

    WiFi.onStationModeDisconnected(on_disconnected);

    if(not_halt()) {
#if PAGE_DEBUG
        server.on("/debug", debug_info);
#endif /* PAGE_DEBUG */
        server.on("/", handle_root);
        server.on("/recover", handle_recover);
        server.on("/config", redirect_to_config);
        server.on("/globals", receive_globals);
        server.on("/profile", receive_profile);
        server.on("/api", send_json);
        server.on("/update", manual_update_check);
        server.on("/apply_update", apply_update);

        const char *headers[] = {"x-Request-Id"};
        size_t headers_size = sizeof(headers) / sizeof(char *);
        server.collectHeaders(headers, headers_size);

        server.begin();

        udp.begin(88);

        user_init();
    } else {
        sendDeviceHalted();
        server.on("/", handle_halt);
        server.begin();
    }

    server.on("/restart", restart);

    ArduinoOTA.begin();
}

void loop() {
    ArduinoOTA.handle();

    /* We do not want the transition to lag, so we don't handle the client */
    if(halt() || all_any_flag_set(device_flags, DEVICE_FLAG_TRANSITION, ALL, NOT_SET) ||
       flags & FLAG_QUICK_TRANSITION) {
        server.handleClient();
    }

    if(halt())
        return;

    int packetSize = udp.parsePacket();
    if(packetSize) {
        uint8_t data[5];
        uint8_t len = (uint8_t) udp.read(data, 5);
        if(len > 0) {
            if(data[1] < DEVICE_COUNT) {
                if(data[0] == 0 && len == 3) {
                    globals.brightness[data[1]] = data[2];
                    convert_color_and_brightness();
                    save_globals(&globals);
                } else if(data[0] == 1 && len == 5) {
                    set_color_manual(globals.color + 3 * data[1], color_from_buf(data + 2));
                    convert_color_and_brightness();
                    save_globals(&globals);
                }
            }
        }
    }

    if(flags & FLAG_NEW_FRAME) {
        flags &= ~FLAG_NEW_FRAME;

        led_count_t virtual_led_offset = 0;
        for(uint8_t d = 0; d < DEVICE_COUNT; ++d) {
            uint8_t *p = strip.getPixels() + virtual_led_offset * 3;
            if((globals.flags[d] & GLOBALS_FLAG_ENABLED
#if TRANSITION_EFFECTS
                       || device_flags[d] & DEVICE_FLAG_TRANSITION
#endif
               ) && globals.flags[d] & GLOBALS_FLAG_EFFECTS) {

                device_effect &device = current_effect[d];
                digital_effect((effect) device.effect, p, virtual_devices_led_count[d], 0,
                               frame + frames[d][TIME_DELAY],
                               frames[d], device.args, device.colors, device.color_count);

#if TRANSITION_EFFECTS
                int16_t d_brightness = transition_brightness_new[d] - transition_brightness_old[d];
                uint8_t brightness = transition_brightness_new[d] + (transition_frame[d] * d_brightness / transition_frames[d]);
#else
                uint8_t brightness = globals.brightness[d];
#endif

                for(uint8_t i = 0; i < virtual_devices_led_count[d]; ++i) {
                    uint8_t index = i * 3;

