RouNNdeL/esp8266-leds/src/main.cpp
                    set_color_manual(p + index, color_brightness(brightness, color_from_buf(p + index)));
                    p[index] = actual_brightness(p[index]);
                    p[index + 1] = actual_brightness(p[index + 1]);
                    p[index + 2] = actual_brightness(p[index + 2]);
                }

                strip.show();
            } else if(globals.flags[d] & GLOBALS_FLAG_ENABLED || device_flags[d] & DEVICE_FLAG_TRANSITION
                                                                 #if !TRANSITION_EFFECTS
                                                                 && !(globals.flags[d] & GLOBALS_FLAG_EFFECTS)
#endif
                    ) {
                uint8_t index = d * 6;
                uint8_t color[3];
                cross_fade(color, color_converted + index, 3, 0,
                           transition_frame[d] * UINT8_MAX / transition_frames[d]);
                color[0] = actual_brightness(color[0]);
                color[1] = actual_brightness(color[1]);
                color[2] = actual_brightness(color[2]);
                for(led_count_t i = 0; i < virtual_devices_led_count[d]; ++i) {
                    set_color_manual(p + i * 3, grb(color_from_buf(color)));
                }
                strip.show();
            } else {
                for(led_count_t i = 0; i < LED_COUNT; ++i) {
                    set_color_manual(p + i * 3, grb(COLOR_BLACK));
                }
                strip.show();
            }

            if(transition_frame[d] >= transition_frames[d] && device_flags[d] & DEVICE_FLAG_TRANSITION) {
#if TRANSITION_EFFECTS
                transition_brightness_old[d] = transition_brightness_new[d];
#endif
                memcpy(color_converted + d * 6 + 3, color_converted + d * 6, 3);
                device_flags[d] &= ~DEVICE_FLAG_TRANSITION;
                transition_frame[d] = 0;
            }

            virtual_led_offset += virtual_devices_led_count[d];
        }

        if(auto_increment && frame && frame % auto_increment == 0 && any_enabled() && globals.profile_count > 1) {
            for(uint8_t d = 0; d < DEVICE_COUNT; ++d) {
                if(device_flags[d] & DEVICE_FLAG_EFFECT_UPDATED) {
                    save_effect(&current_effect[d], d, globals.current_device_profile[d]);
                    device_flags[d] &= ~DEVICE_FLAG_EFFECT_UPDATED;
                }
            }
            increment_profile();
            refresh_profile();
            frame = 0;
        }
    }
}
